andysworkshop/stm32plus/lib/include/traits/f4/traits.h
/*
 * This file is a part of the open source stm32plus library.
 * Copyright (c) 2011,2012,2013,2014 Andy Brown <www.andybrown.me.uk>
 * Please see website for licensing terms.
 */

#pragma once

// ensure the MCU series is correct
#ifndef STM32PLUS_F4
#error This class can only be used with the STM32F4 series
#endif


namespace stm32plus {

  /**
   * The traits templates give us a type as a container for the various constants
   * that we need to operate a peripheral. See config/custom_traits.h for the
   * mechanism that you can use to override these defaults, for example to change
   * the GPIO speed to something other than the default.
   */

  template<PeripheralName TPeripheralName>
  struct PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_ADC1> {
    enum {
      PERIPHERAL_BASE = ADC1_BASE
    };
  };
  typedef PeripheralTraits<PERIPHERAL_ADC1> Adc1PeripheralTraits;

#if defined(STM32PLUS_F4_HAS_ADC2_3)
  template<>
  struct PeripheralTraits<PERIPHERAL_ADC2> {
    enum {
      PERIPHERAL_BASE = ADC2_BASE
    };
  };
  typedef PeripheralTraits<PERIPHERAL_ADC2> Adc2PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_ADC3> {
    enum {
      PERIPHERAL_BASE = ADC3_BASE
    };
  };
  typedef PeripheralTraits<PERIPHERAL_ADC3> Adc3PeripheralTraits;
#endif

  template<>
  struct PeripheralTraits<PERIPHERAL_CAN1> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = CAN1_BASE,
    };
  };
  typedef PeripheralTraits<PERIPHERAL_CAN1> Can1PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_CAN2> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = CAN2_BASE,
    };
  };
  typedef PeripheralTraits<PERIPHERAL_CAN2> Can2PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_DAC1> {
    enum {
      CHANNEL_NUMBER = DAC_Channel_1
    };
  };
  typedef PeripheralTraits<PERIPHERAL_DAC1> Dac1PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_DAC2> {
    enum {
      CHANNEL_NUMBER = DAC_Channel_2
    };
  };
  typedef PeripheralTraits<PERIPHERAL_DAC1> Dac1PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_GPIO> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz
    };
  };
  typedef PeripheralTraits<PERIPHERAL_GPIO> GpioPeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_FSMC> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
    };
  };
  typedef PeripheralTraits<PERIPHERAL_FSMC> FsmcPeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_SDIO> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
    };
  };
  typedef PeripheralTraits<PERIPHERAL_SDIO> SdioPeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_I2C1> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = I2C1_BASE,
    };
  };
  typedef PeripheralTraits<PERIPHERAL_I2C1> I2C1PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_I2C2> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = I2C2_BASE,
    };
  };
  typedef PeripheralTraits<PERIPHERAL_I2C2> I2C2PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_I2C3> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = I2C3_BASE,
    };
  };
  typedef PeripheralTraits<PERIPHERAL_I2C3> I2C3PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_I2S2> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = SPI2_BASE,
    };
  };
  typedef PeripheralTraits<PERIPHERAL_I2S2> I2S2PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_I2S3> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = SPI3_BASE,
    };
  };
  typedef PeripheralTraits<PERIPHERAL_I2S3> I2S3PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_SPI1> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = SPI1_BASE,
    };
  };
  typedef PeripheralTraits<PERIPHERAL_SPI1> Spi1PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_SPI2> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = SPI2_BASE,
    };
  };
  typedef PeripheralTraits<PERIPHERAL_SPI2> Spi2PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_SPI3> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = SPI3_BASE,
    };
  };
  typedef PeripheralTraits<PERIPHERAL_SPI3> Spi3PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_TIMER1> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = TIM1_BASE,
      COUNTER_MAX = 0xFFFF
    };
  };
  typedef PeripheralTraits<PERIPHERAL_TIMER1> Timer1PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_TIMER2> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = TIM2_BASE,
      COUNTER_MAX = 0xFFFFFFFF
    };
  };
  typedef PeripheralTraits<PERIPHERAL_TIMER2> Timer2PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_TIMER3> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = TIM3_BASE,
      COUNTER_MAX = 0xFFFF
    };
  };
  typedef PeripheralTraits<PERIPHERAL_TIMER3> Timer3PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_TIMER4> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = TIM4_BASE,
      COUNTER_MAX = 0xFFFF
    };
  };
  typedef PeripheralTraits<PERIPHERAL_TIMER4> Timer4PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_TIMER5> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = TIM5_BASE,
      COUNTER_MAX = 0xFFFFFFFF
    };
  };
  typedef PeripheralTraits<PERIPHERAL_TIMER5> Timer5PeripheralTraits;

#if defined(STM32PLUS_F4_HAS_TIM6_7_8_12_13_14)

  template<>
  struct PeripheralTraits<PERIPHERAL_TIMER6> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = TIM6_BASE,
      COUNTER_MAX = 0xFFFF
    };
  };
  typedef PeripheralTraits<PERIPHERAL_TIMER6> Timer6PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_TIMER7> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = TIM7_BASE,
      COUNTER_MAX = 0xFFFF
    };
  };
  typedef PeripheralTraits<PERIPHERAL_TIMER7> Timer7PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_TIMER8> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = TIM8_BASE,
      COUNTER_MAX = 0xFFFF
    };
  };
  typedef PeripheralTraits<PERIPHERAL_TIMER8> Timer8PeripheralTraits;

#endif

  template<>
  struct PeripheralTraits<PERIPHERAL_TIMER9> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = TIM9_BASE,
      COUNTER_MAX = 0xFFFF
    };
  };
  typedef PeripheralTraits<PERIPHERAL_TIMER9> Timer9PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_TIMER10> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = TIM10_BASE,
      COUNTER_MAX = 0xFFFF
    };
  };
  typedef PeripheralTraits<PERIPHERAL_TIMER10> Timer10PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_TIMER11> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = TIM11_BASE,
      COUNTER_MAX = 0xFFFF
    };
  };
  typedef PeripheralTraits<PERIPHERAL_TIMER11> Timer11PeripheralTraits;

#if defined(STM32PLUS_F4_HAS_TIM6_7_8_12_13_14)

  template<>
  struct PeripheralTraits<PERIPHERAL_TIMER12> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = TIM12_BASE,
      COUNTER_MAX = 0xFFFF
    };
  };
  typedef PeripheralTraits<PERIPHERAL_TIMER12> Timer12PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_TIMER13> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = TIM13_BASE,
      COUNTER_MAX = 0xFFFF
    };
  };
  typedef PeripheralTraits<PERIPHERAL_TIMER13> Timer13PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_TIMER14> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = TIM14_BASE,
      COUNTER_MAX = 0xFFFF
    };
  };
  typedef PeripheralTraits<PERIPHERAL_TIMER14> Timer14PeripheralTraits;

#endif
  
  template<>
  struct PeripheralTraits<PERIPHERAL_USART1> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = USART1_BASE,
    };
  };
  typedef PeripheralTraits<PERIPHERAL_USART1> Usart1PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_USART2> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = USART2_BASE,
    };
  };
  typedef PeripheralTraits<PERIPHERAL_USART2> Usart2PeripheralTraits;

#if defined(STM32PLUS_F4_HAS_USART3_4_5)

  template<>
  struct PeripheralTraits<PERIPHERAL_USART3> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = USART3_BASE,
    };
  };
  typedef PeripheralTraits<PERIPHERAL_USART3> Usart3PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_UART4> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = UART4_BASE,
    };
  };
  typedef PeripheralTraits<PERIPHERAL_UART4> Uart4PeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_UART5> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = UART5_BASE,
    };
  };
  typedef PeripheralTraits<PERIPHERAL_UART5> Uart5PeripheralTraits;
#endif

#if defined(STM32PLUS_F4_HAS_MAC)

  template<>
  struct PeripheralTraits<PERIPHERAL_MAC> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = ETH_BASE,
    };
  };
  typedef PeripheralTraits<PERIPHERAL_MAC> MacPeripheralTraits;
#endif

  template<>
  struct PeripheralTraits<PERIPHERAL_OTG_FS> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz
    };
  };
  typedef PeripheralTraits<PERIPHERAL_OTG_FS> OtgFsPeripheralTraits;

  template<>
  struct PeripheralTraits<PERIPHERAL_USART6> {
    enum {
      GPIO_SPEED = GPIO_Speed_50MHz,
      PERIPHERAL_BASE = USART6_BASE,
    };
  };
  typedef PeripheralTraits<PERIPHERAL_USART6> Usart6PeripheralTraits;
}
